nvitya/vihal/xtensa/ESP/ESP32/esp32_vihal.h
//-----------------------------------------------------------------------------
// GPIO
//-----------------------------------------------------------------------------

#define ESP_GPIO_COUNT   40
#define ESP_PAD_COUNT    40

// The ESP32 "pad"-s are referred mostly by their GPIO number, which is different from the package pin number
// And additionally some pads have officially special names, although they also can be used as GPIO

#define PAD_GPIO0    0
#define PAD_GPIO1    1
#define PAD_GPIO2    2
#define PAD_GPIO3    3
#define PAD_GPIO4    4
#define PAD_GPIO5    5
#define PAD_GPIO6    6
#define PAD_GPIO7    7
#define PAD_GPIO8    8
#define PAD_GPIO9    9
#define PAD_GPIO10  10
#define PAD_GPIO11  11
#define PAD_GPIO12  12
#define PAD_GPIO13  13
#define PAD_GPIO14  14
#define PAD_GPIO15  15
#define PAD_GPIO16  16
#define PAD_GPIO17  17
#define PAD_GPIO18  18
#define PAD_GPIO19  19
#define PAD_GPIO20  20
#define PAD_GPIO21  21
#define PAD_GPIO22  22
#define PAD_GPIO23  23
#define PAD_GPIO24  24
#define PAD_GPIO25  25
#define PAD_GPIO26  26
#define PAD_GPIO27  27
#define PAD_GPIO28  28
#define PAD_GPIO29  29
#define PAD_GPIO30  30
#define PAD_GPIO31  31
#define PAD_GPIO32  32
#define PAD_GPIO33  33
#define PAD_GPIO34  34
#define PAD_GPIO35  35
#define PAD_GPIO36  36
#define PAD_GPIO37  37
#define PAD_GPIO38  38
#define PAD_GPIO39  39

// pads with special names

#define PAD_U0TXD          1
#define PAD_U0RXD          3
#define PAD_SD_CLK         6
#define PAD_SD_DATA_0      7
#define PAD_SD_DATA_1      8
#define PAD_SD_DATA_2      9
#define PAD_SD_DATA_3     10
#define PAD_SD_CMD        11
#define PAD_MTDI          12
#define PAD_MTCK          13
#define PAD_MTMS          14
#define PAD_MTDO          15
#define PAD_32K_XP        32
#define PAD_32K_XN        33
#define PAD_VDET_1        34
#define PAD_VDET_2        35
#define PAD_SENSOR_VP     36
#define PAD_SENSOR_CAPP   37
#define PAD_SENSOR_CAPN   37
#define PAD_SENSOR_VN     39


typedef struct
{
  volatile uint32_t   REG;
  volatile uint32_t   SET;
  volatile uint32_t   CLR;
//
} esp_gpio_out_t;

typedef struct
{
  volatile uint32_t   REG;
  volatile uint32_t   SET;
  volatile uint32_t   CLR;
//
} esp_gpio_enable_t;

typedef struct
{
  volatile uint32_t   REG;
  volatile uint32_t   SET;
  volatile uint32_t   CLR;
//
} esp_gpio_irqstat_t;

typedef struct
{
  uint32_t               _pad_000;
  esp_gpio_out_t         OUT[2];     // output (data, set, clear)
  uint32_t               _pad_01C;
  esp_gpio_enable_t      ENABLE[2];  // output enable
  volatile uint32_t      STRAP;      // bootstrap pin value
  volatile uint32_t      IN[2];      // input
  esp_gpio_irqstat_t     STATUS[2];  // interrupt status register
  uint32_t               _pad_05C;
  volatile uint32_t      ACPU_INT;
  volatile uint32_t      ACPU_NMI_INT;
  volatile uint32_t      PCPU_INT;
  volatile uint32_t      PCPU_NMI_INT;
  uint32_t               _pad_070;
  volatile uint32_t      ACPU_INT1;
  volatile uint32_t      ACPU_NMI_INT1;
  volatile uint32_t      PCPU_INT1;
  volatile uint32_t      PCPU_NMI_INT1;
  uint32_t               _pad_084;
  volatile uint32_t      PIN[40];    // pin configuration
  uint32_t               _pad_128;
  uint32_t               _pad_12C;
  volatile uint32_t      FUNC_IN_SEL_CFG[256];  // Peripheral function n input selection
  volatile uint32_t      FUNC_OUT_SEL_CFG[40];  // Peripheral output selection for GPIOn
//
} esp_gpio_t;

#if 0
  // definition check:

  static_assert(offsetof(esp_gpio_t, STRAP)    == 0x038, "strap offset error");
  static_assert(offsetof(esp_gpio_t, PCPU_INT) == 0x068, "pcpu offset error");
  static_assert(offsetof(esp_gpio_t, PIN)      == 0x088, "pin offset error");
  static_assert(offsetof(esp_gpio_t, FUNC_IN_SEL_CFG) == 0x130, "func_in_sel_cfg offset error");
  static_assert(offsetof(esp_gpio_t, FUNC_OUT_SEL_CFG) == 0x530, "func_out_sel_cfg offset error");
#endif

typedef struct
{
  volatile uint32_t   PIN_CTRL;  // Clock output configuration
  volatile uint32_t   CFG[36];   // Configuration register, the order here is different from GPIO numbering !
//
} esp_io_mux_t;

//-----------------------------------------------------------------------------
// Instances
//-----------------------------------------------------------------------------

#define GPIO         ((esp_gpio_t *)(0x3FF44000))
#define IO_MUX     ((esp_io_mux_t *)(0x3FF49000))

//-----------------------------------------------------------------------------
// UART
//-----------------------------------------------------------------------------

typedef struct
{
  volatile uint32_t FIFO;            // 0x00
  volatile uint32_t INT_RAW;         // 0x04
  volatile uint32_t INT_ST;          // 0x08
  volatile uint32_t INT_ENA;         // 0x0C
  volatile uint32_t INT_CLR;         // 0x10
  volatile uint32_t CLKDIV;          // 0x14
  volatile uint32_t AUTOBAUD;        // 0x18
  volatile uint32_t STATUS;          // 0x1C
  volatile uint32_t CONF0;           // 0x20
  volatile uint32_t CONF1;           // 0x24
  volatile uint32_t LOWPULSE;        // 0x28
  volatile uint32_t HIGHPULSE;       // 0x2C
  volatile uint32_t RXD_CNT;         // 0x30
  volatile uint32_t FLOW_CONF;       // 0x34
  volatile uint32_t SLEEP_CONF;      // 0x38
  volatile uint32_t SWFC_CONF;       // 0x3C
  volatile uint32_t IDLE_CONF;       // 0x40
  volatile uint32_t RS485_CONF;      // 0x44
  volatile uint32_t AT_CMD_PRECNT;   // 0x48
  volatile uint32_t AT_CMD_POSTCNT;  // 0x4c
  volatile uint32_t AT_CMD_GAPTOUT;  // 0x50
  volatile uint32_t AT_CMD_CHAR;     // 0x54
  volatile uint32_t MEM_CONF;        // 0x58
  volatile uint32_t MEM_TX_STATUS;   // 0x5c
  volatile uint32_t MEM_RX_STATUS;   // 0x60
  volatile uint32_t MEM_CNT_STATUS;  // 0x64
  volatile uint32_t POSPULSE;        // 0x68
  volatile uint32_t NEGPULSE;        // 0x6c
  volatile uint32_t _pad70;          // 0x70
  volatile uint32_t _pad74;          // 0x74
  volatile uint32_t DATE;            // 0x78
  volatile uint32_t ID;              // 0x7C
//
} esp32_uart_t;

